Tekla Open API Reference for Tekla Structures 2025
AnalysisPartBarAttributes.ForceStraightSegments Property
 The straight force segments.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartBarAttributes.ForceStraightSegmentsEnum ForceStraightSegments { get; set; }
Public Property ForceStraightSegments As AnalysisPartBarAttributes.ForceStraightSegmentsEnum
	Get
	Set
Property Value
Type: AnalysisPartBarAttributes.ForceStraightSegmentsEnum
See Also
Reference
AnalysisPartBarAttributes Class
Tekla.Structures.Analysis Namespace